[
  {
    "id": "kota-factory-season-3-tv-series",
    "group": "Dr Trailer",
    "badge": " [ Tv Series ] ",
    "license": "movies",
    "version": " Lectora_21.5.3_Build_12504.",
    "developers": "Lectora",
    "title": "Sanctuary: A Witch's Tale Season 1",
    "name": " Sanctuary: A Witch's Tale Season 1 - 2024. ",
    "channelposter": "https://res.cloudinary.com/db36kfuq3/image/upload/v1719282407/Sanctuary_wqbr6u.webp",
    "image": "https://res.cloudinary.com/db36kfuq3/image/upload/v1719282407/Sanctuary_wqbr6u.webp",
    "backimage": "https://res.cloudinary.com/db36kfuq3/image/upload/v1719282407/Sanctuary_1_jkfugk.webp",
    "movies.watch": "../movies/kota-factory-season-3-tv-series/",
    "synopsis": " Welcome to movies Magazine! Dive into our detailed review of 'Sanctuary: A Witch's Tale Season 1 - 2024,' a groundbreaking movie that redefines science fiction and fantasy. Explore the plot, performances, and stunning visuals of this cinematic masterpiece in our comprehensive analysis. Join us at movies Magazine for the latest insights on 'Sanctuary: A Witch's Tale Season 1 - 2024' and other global cinematic treasures.",
    "videotvitem": [
      "tt21632986/1/1",
      "tt21632986/1/2",
      "tt21632986/1/3",
      "tt21632986/1/4",
      "tt21632986/1/5",
      "tt21632986/1/6",
      "tt21632986/1/7"
    ],
    "videourl": "https://vidsrc.to/embed/movie/tt21632986/",
    "text": "Sanctuary: A Witch's Tale is an American supernatural drama television series written and created by Debbie Horsfield based on the 2020 novel Sanctuary: A Novel of Suspense, Witchcraft, and Small Town Secrets by V.V. James. The seven-part series premiered on January 4, 2024. (MORE…)",
    "datePublished": "05-04-2024",
    "dateModified": "31-05-2024",
    "softwareVersion": "Lectora 21.5.3 Build 12504",
    "siteurl": "https://moviesmagazine.vercel.app/movies/kota-factory-season-3-tv-series/",
    "baseurl": "https://moviesmagazine.vercel.app/movies/",
    "operatingSystem": "Windows",
    "applicationCategory": "movies",
    "interactionStatistic": "250786",
    "keywords": "sanctuary: a witch's tale season 1 review,sanctuary: a witch's tale season 1 movie analysis,sanctuary: a witch's tale season 1 plot summary,sanctuary: a witch's tale season 1 cast,sanctuary: a witch's tale season 1 director,sanctuary: a witch's tale season 1 cinematography,sanctuary: a witch's tale season 1 storyline,sanctuary: a witch's tale season 1 character analysis,sanctuary: a witch's tale season 1 themes,sanctuary: a witch's tale season 1 performances",
    "head1": "Synopsis",
    "news1": "In the fictional small English town of Sanctuary, witches have lived openly for centuries, revered as sacred and essential members of the community. This unusual harmony between the supernatural and the mundane has fostered a unique culture where magical remedies are as common as medical ones. At the heart of this magical enclave is Sarah Fenn, a respected witch whose potions and spells have mended many ailments when conventional methods have faltered. Sarah is not just a healer; she is a cornerstone of Sanctuary's intricate social fabric, a symbol of the town's harmonious blend of old and new, magical and mundane. \n\n However, the tranquility of Sanctuary is shattered when a tragic accident occurs. Dan Whithall, a local teen known for his rugby prowess and bullying nature, is accidentally pushed to his death at a party. Dan's death sends shockwaves through the town, but it is his mother, Abigail Whithall, who is most profoundly affected. Grief-stricken and unable to accept the reality of her son's flaws, Abigail transforms her sorrow into a fervent conviction that Dan was a saint and that his death was the result of malevolent forces.   \n\n  Consumed by her need for answers and driven by her grief, Abigail begins to scrutinize the circumstances surrounding Dan's death. Her anguish warps her perception, leading her to believe that Sarah Fenn and her daughter, Harper, are somehow responsible. Harper, who was once Dan's romantic interest, had suffered greatly at his hands. Dan's betrayal and abusive behavior were known to many, but in Abigail's eyes, Harper becomes the scapegoat for her son's untimely demise. \n\n  Abigail's grief morphs into a modern witch hunt, fueled by a desperate need for justice—or what she perceives as justice. She starts a campaign against Sarah and Harper, leveraging the town's age-old fear of witchcraft to rally support. Abigail paints a picture of her son as an innocent victim of dark forces, turning a blind eye to his true nature. She capitalizes on the latent prejudices and superstitions within the community, igniting a firestorm of suspicion and paranoia. \n\n Sarah, who has always used her powers for good, finds herself at the center of a maelstrom. The community that once revered her begins to question her intentions. Friends and neighbors who had sought her help now whisper behind her back, their faith in her wavering under Abigail's relentless accusations. The fear of the unknown, a fear that had been dormant for so long, resurfaces with a vengeance.  \n\n Harper, too, is thrust into the spotlight, her past relationship with Dan scrutinized under the harsh glare of public opinion. She becomes a symbol of both victimhood and suspicion, a young woman caught in the crossfire of grief and hysteria. Harper's own pain and trauma are overshadowed by the town's collective need to find a villain in their midst. \n\n As the witch hunt gains momentum, Sanctuary becomes a battleground between reason and hysteria, between truth and deception. The once-peaceful town is torn apart by fear and suspicion, its harmony shattered by the resurgence of ancient prejudices. Abigail's campaign against Sarah and Harper forces the town to confront its deepest fears and the darker aspects of human nature. \n\n In the end, the story of Sanctuary is a poignant reminder of the thin line between reverence and fear, between acceptance and persecution. It is a tale of how easily a community can be swayed by grief and fear, and how the quest for justice can sometimes lead to tragic injustice. Sarah and Harper's plight serves as a powerful allegory for the dangers of scapegoating and the enduring strength of those who are unjustly persecuted. \n\n",
    "head2": "Images",
    "image1": "https://res.cloudinary.com/db36kfuq3/image/upload/v1719282406/Sanctuar3_wctlk5.webp",
    "image2": "https://res.cloudinary.com/db36kfuq3/image/upload/v1719282407/Sanctuar4_eju0nd.webp",
    "image3": "https://res.cloudinary.com/db36kfuq3/image/upload/v1719282406/Sanctuary5_uargat.webp",
    "image4": "https://res.cloudinary.com/db36kfuq3/image/upload/v1719282406/Sanctuar6_qt3gfe.webp",
    "image5": "https://res.cloudinary.com/db36kfuq3/image/upload/v1719282406/Sanctuar7_udigtl.webp",
    "image6": "https://res.cloudinary.com/db36kfuq3/image/upload/v1719282406/Sanctuary10_p7q3ew.webp",
    "image7": "https://res.cloudinary.com/db36kfuq3/image/upload/v1719282406/Sanctuary8_e3wkie.webp",
    "image8": "https://res.cloudinary.com/db36kfuq3/image/upload/v1719282405/Sanctuary9_jgu0pg.webp",
    "downloadlink": "https://hellabyte.one/drive/s/66597764a3fb848ac13de9b0",
    "downloadlink1": "magnet:?xt=urn:btih:7D2D34498980B40481D062BBBB3B166586B6EDCA&dn=The+First+Omen&tr=udp%3A%2F%2Ftracker.opentrackr.org%3A1337%2Fannounce&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969%2Fannounce&amp;tr=udp%3A%2F%2F9.rarbg.to%3A2710%2Fannounce&amp;tr=udp%3A%2F%2Fp4p.arenabg.ch%3A1337%2Fannounce&amp;tr=udp%3A%2F%2Ftracker.cyberia.is%3A6969%2Fannounce&amp;tr=http%3A%2F%2Fp4p.arenabg.com%3A1337%2Fannounce&amp;tr=udp%3A%2F%2Ftracker.internetwarriors.net%3A1337%2Fannounce",
    "genre": [
      "Fantasy, ",
      "Thriller, ",
      "Drama."
    ],
    "directorname": "Debbie Horsfield.",
    "country": "United States.",
    "language": "English.",
    "starring": [
      "Elaine Cassidy, ",
      "Hazel Doupe, ",
      "Stephanie Levi-John, ",
      "Kelly Campbell, ",
      "Stephen Lord."
    ],
    "actor1": "Elaine Cassidy.",
    "actor2": "Hazel Doupe.",
    "actor3": "Stephanie Levi-John.",
    "actor4": "Kelly Campbell.",
    "actor5": "Stephen Lord. ",
    "directorimg": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRvd87I9ZKTDtDcODKcyJ3nPQKqgDDG_lfaGKwAeeqpuGzYOMXTqlp6YEP2C5o3HGzWcM0&usqp=CAU",
    "actor1img": " https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSDInxwrfEjUvHajjLLRWuJabkxRWUi6S5--Q&s",
    "actor2img": " https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ9FjpR7vBkj48B3kfaL3kG8oD_ObkYoD3eEA&s",
    "actor3img": " https://ntvb.tmsimg.com/assets/assets/1171137_v9_aa.jpg",
    "actor4img": " https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQIYXE-WDNwsLtw00VImxhp-sNMqrRcrxO7s2O4IVN9JRIoUFSmadxd4cf3Jm2mXTRp6dI&usqp=CAU",
    "actor5img": " https://m.media-amazon.com/images/M/MV5BMzQ2NjY4MDMtMDgxNi00Y2RhLWEwOWItMWZjYjFmYTJmYTIyXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_.jpg"
  },
  {
    "id": "bad-boys-ride-or-die-2024",
    "group": "Dr Trailer",
    "badge": " [ Movie ] ",
    "license": "movie",
    "version": " Lectora_21.5.3_Build_12504.",
    "developers": "Lectora",
    "title": "Bad Boys: Ride or Die ",
    "name": " Bad Boys: Ride or Die 2024. ",
    "channelposter": "https://res.cloudinary.com/db36kfuq3/image/upload/v1719285302/Bad_Boys_bu4psl.webp",
    "image": "https://res.cloudinary.com/db36kfuq3/image/upload/v1719285302/Bad_Boys_bu4psl.webp",
    "backimage": "https://res.cloudinary.com/db36kfuq3/image/upload/v1719285302/Bad_Boys_1_ypn1r3.webp",
    "movies.watch": "../movies/bad-boys-ride-or-die-2024/",
    "synopsis": " Welcome to movies Magazine! Dive into our detailed review of 'Bad Boys: Ride or Die,' a groundbreaking movie that redefines science fiction and fantasy. Explore the plot, performances, and stunning visuals of this cinematic masterpiece in our comprehensive analysis. Join us at movies Magazine for the latest insights on 'Bad Boys: Ride or Die' and other global cinematic treasures.",
    "videomoviesitem": [
      "tt4919268"
    ],
    "videourl": "https://vidsrc.to/embed/movie/tt4919268/",
    "text": "This Summer, the world's favorite Bad Boys are back with their iconic mix of edge-of-your seat action and outrageous comedy but this time with a twist: Miami's finest are now on the run. (MORE…)",
    "datePublished": "05-04-2024",
    "dateModified": "31-05-2024",
    "softwareVersion": "Lectora 21.5.3 Build 12504",
    "siteurl": "https://moviesmagazine.vercel.app/movies/bad-boys-ride-or-die-2024/",
    "baseurl": "https://moviesmagazine.vercel.app/movies/",
    "operatingSystem": "Windows",
    "applicationCategory": "movies",
    "interactionStatistic": "250786",
    "keywords": "Kalki 2898 AD review,Kalki 2898 AD movie analysis,Kalki 2898 AD plot summary,Kalki 2898 AD cast,Kalki 2898 AD director,Kalki 2898 AD cinematography,Kalki 2898 AD storyline,Kalki 2898 AD character analysis,Kalki 2898 AD themes,Kalki 2898 AD performances",
    "head1": "Synopsis",
    "news1": "Four years after the tragic death of Isabel Aretas, Detective Mike Lowrey finds a new beginning in his life by marrying his physical therapist, Christine. Their wedding, however, takes an unexpected turn when Mike's partner, Detective Marcus Burnett, suffers a mild heart attack during the ceremony. This health scare sends Marcus into a coma, where he experiences a profound vision of their late captain, Conrad Howard. In this vision, Howard reassures Marcus that his time has not yet come, instilling in him a renewed sense of invincibility upon waking. \n\n Once Marcus regains consciousness, he interprets his vision as a sign that he is invincible. Shortly after, a scandal erupts in the media, revealing that Captain Howard was allegedly involved in corruption with drug cartels. Determined to clear their mentor's name and restore his tarnished legacy, Mike and Marcus embark on a mission to uncover the truth. They are joined by Captain Rita Secada and her new boyfriend, mayoral candidate Adam Lockwood, in their quest for justice. \n\n  Their investigation leads them to visit Mike's son, Armando Aretas, who is serving time for Howard's murder. Armando reveals a crucial piece of the puzzle: Howard was never corrupt, but he was on the verge of exposing those who were. The corrupt officials, fearing exposure, hired Armando and his mother to kill Howard. Armando, seeking redemption, offers to help Mike and Marcus identify the true culprits behind Howard's murder. \n\n  As the trio delves deeper into the conspiracy, they discover that the conspirators are attempting to access Howard's computer. However, a fail-safe mechanism triggers a pre-recorded video sent to Mike and Marcus, warning them about widespread corruption within federal and state law enforcement. In this video, Howard uses the code phrase 'Coke bottle,' leading them to their former hacker colleague, Fletcher. At Fletcher's club, they retrieve a QR code hidden in wall art, unlocking a second video from Howard. However, their success is short-lived as assassins track them down and kill Fletcher. \n\n Meanwhile, Armando faces his own peril as he is attacked by fellow inmates posing as prisoners. Displaying his formidable combat skills, he manages to eliminate them all. Mike and Marcus arrange for Armando to be airlifted to a more secure location in Miami, but the conspirators strike again, causing the helicopter to crash. Despite the crash, Mike, Marcus, and Armando survive, only to find themselves branded as fugitives.  \n\n  With a bounty on their heads, the trio is hunted by law enforcement and criminals alike. Amidst this chaos, U.S. Marshal Judy Howard, Conrad's daughter, vows revenge on Armando for her father's death. The tension escalates as AMMO team members Dorn and Kelly assist Mike, Marcus, and Armando in decoding the clues left by Howard. They uncover that a former Army Ranger turned DEA agent, James McGrath, is the mastermind behind the corruption. McGrath, once tortured by the cartel into betraying his associates, has since become a cartel boss himself. \n\n  The stakes reach their zenith when McGrath kidnaps Christine and Callie, Judy's daughter. He also targets Marcus's family, but Reggie, Marcus's Marine son-in-law, successfully defends them. The team exposes Lockwood as McGrath's accomplice and uses him as bait to rescue the hostages at a dilapidated alligator-themed amusement park. \n\n In a climactic showdown, Lockwood meets a grisly end, devoured by an alligator after attempting to double-cross the team. Mike confronts McGrath, who forces him into a deadly choice between Christine and Marcus. Mike, leveraging Marcus's belief in his invincibility, shoots Marcus in his bulletproof vest, creating an opportunity for Christine and Marcus to break free. In the ensuing chaos, Mike kills McGrath. Judy, meanwhile, prepares to kill Armando but is stopped by Callie, who reveals that Armando saved her life. Judy, reluctantly grateful, spares Armando and lets him escape.  \n\n With the corruption exposed and their names cleared, Mike and Marcus celebrate their victory and newfound freedom. The duo, along with Reggie, cooks food on a public grill, basking in the simple joy of a job well done and the bonds of family and friendship.",
    "head2": "Images",
    "image1": "https://res.cloudinary.com/db36kfuq3/image/upload/v1719285302/Bad_Boys_1_ypn1r3.webp",
    "image2": "https://res.cloudinary.com/db36kfuq3/image/upload/v1719285302/Bad_Boys_2_vsl0yz.webp",
    "image3": "https://res.cloudinary.com/db36kfuq3/image/upload/v1719285302/Bad_Boys_3_kvufj9.webp",
    "image4": "https://res.cloudinary.com/db36kfuq3/image/upload/v1719285301/Bad_Boys_4_swe9rd.webp",
    "image5": "https://res.cloudinary.com/db36kfuq3/image/upload/v1719285302/Bad_Boys_5_xizxd4.webp",
    "image6": "https://res.cloudinary.com/db36kfuq3/image/upload/v1719285301/Bad_Boys_6_kactpn.webp",
    "image7": "https://res.cloudinary.com/db36kfuq3/image/upload/v1719285301/Bad_Boys_7_akbe0k.webp",
    "image8": "https://res.cloudinary.com/db36kfuq3/image/upload/v1719285301/Bad_Boys_8_dwcijx.webp",
    "downloadlink": "https://hellabyte.one/drive/s/66597764a3fb848ac13de9b0",
    "downloadlink1": "magnet:?xt=urn:btih:7D2D34498980B40481D062BBBB3B166586B6EDCA&dn=The+First+Omen&tr=udp%3A%2F%2Ftracker.opentrackr.org%3A1337%2Fannounce&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969%2Fannounce&amp;tr=udp%3A%2F%2F9.rarbg.to%3A2710%2Fannounce&amp;tr=udp%3A%2F%2Fp4p.arenabg.ch%3A1337%2Fannounce&amp;tr=udp%3A%2F%2Ftracker.cyberia.is%3A6969%2Fannounce&amp;tr=http%3A%2F%2Fp4p.arenabg.com%3A1337%2Fannounce&amp;tr=udp%3A%2F%2Ftracker.internetwarriors.net%3A1337%2Fannounce",
    "genre": [
      "Action. ",
      "Adventure, ",
      "Comedy."
    ],
    "directorname": "Adil El Arbi, Bilall Fallah.",
    "country": "United States.",
    "language": "English.",
    "starring": [
      "Will Smith, ",
      "Martin Lawrence, ",
      "Vanessa Hudgens, ",
      "Alexander Ludwig, ",
      "Paola Núñez."
    ],
    "actor1": "Will Smith.",
    "actor2": "Martin Lawrence.",
    "actor3": "Vanessa Hudgens.",
    "actor4": "Alexander Ludwig.",
    "actor5": "Paola Núñez. ",
    "directorimg": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTuKkmZRgXbg3w08Fd5fcvzLoyEYvWEXn7Lvjsjt5c9rUsdzBU5N4fZoNvavOZPKe9tMnU&usqp=CAU",
    "actor1img": " https://cdn.britannica.com/66/103066-050-B89D5EAF/Will-Smith-actor-musician-2006.jpg",
    "actor2img": " https://ntvb.tmsimg.com/assets/assets/990_v9_bb.jpg",
    "actor3img": " https://upload.wikimedia.org/wikipedia/commons/thumb/8/82/Vanessa_Hudgens_Allure_3.jpg/220px-Vanessa_Hudgens_Allure_3.jpg",
    "actor4img": " https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTFsIxClyeuKW1RQHIZQqPiPd44atj-pAVuMA&s",
    "actor5img": " https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRvqsY8dlTKNa7Twr8A6ITQ31mlEvHl3f2Uig&s"
  }
]